run/mixedWeld/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoReactingMultiphaseInterFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5e-6;

deltaT          1e-8;

writeControl    adjustable;

writeInterval   1e-6;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxDeltaT       5e-8;

maxCo           0.05;

maxAlphaCo      0.05;

maxAlphaDdt     0.05; // Check this

maxDi           0.05; // Check this

libs 
(
    spheresToCell
);

// ************************************************************************* //

DebugSwitches
{
    laserDTRM   1;
}

OptimisationSwitches
{
    fileHandler collated;
}

functions
{
    divU
    {
        type            div;
        libs            (fieldFunctionObjects);

        writeControl    writeTime;
        writeFields     true;
        regionType      all;

        result          divU;

        field           phi;
    }

    maxValue
    {
        type            fieldMinMax;

        libs            (fieldFunctionObjects);

        log             true;

        writeControl    writeTime;

        mode       magnitude;

        fields (p_rgh U T divU);
    }
}