run/mixedWeld/constant/thermophysicalProperties.gas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         multiComponentMixture;
    transport       const;
    thermo          hConst;
    equationOfState incompressiblePerfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

species
(
    air 
    steel 
    copper
);

inertSpecie air;

air
{
    specie
    {
        nMoles      1;
        molWeight   28.9;
    }
    equationOfState
    {
        pRef        1e5;
    }
    thermodynamics
    {
        Hf          0;
        Cp          718;
    }
    transport
    {
        mu          1.77625e-05;
        Pr          0.54;
    }
}

steel
{
    specie
    {
        nMoles          1;
        molWeight       55;
    }
    equationOfState
    {
        pRef            1e5;
    }
    thermodynamics
    {
        Cp              770;
        Hf              0;
    }
    transport
    {
        mu              0.002;
        Pr              0.077;
    }
}

copper
{
    specie
    {
        nMoles          1;
        molWeight       55;
    }
    equationOfState
    {
        pRef            1e5;
    }
    thermodynamics
    {
        Cp              770;
        Hf              0;
    }
    transport
    {
        mu              0.002;
        Pr              0.077;
    }
}


// ************************************************************************* //
